{"class_name": "Functional", "config": {"name": "model_1", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 278], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_2"}, "registered_name": null, "name": "input_2", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 64], "dtype": "float32", "sparse": false, "ragged": false, "name": "a0"}, "registered_name": null, "name": "a0", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 64], "dtype": "float32", "sparse": false, "ragged": false, "name": "c0"}, "registered_name": null, "name": "c0", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "LSTM", "config": {"name": "lstm", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "registered_name": null, "build_config": {"input_shape": [[null, 1, 278], [null, 64], [null, 64]]}, "name": "lstm", "inbound_nodes": [[["input_2", 0, 0, {}], ["a0", 0, 0, {}], ["c0", 0, 0, {}]], [["lambda_12", 0, 0, {}], ["lstm", 0, 0, {}], ["lstm", 0, 2, {}]], [["lambda_13", 0, 0, {}], ["lstm", 1, 0, {}], ["lstm", 1, 2, {}]], [["lambda_14", 0, 0, {}], ["lstm", 2, 0, {}], ["lstm", 2, 2, {}]], [["lambda_15", 0, 0, {}], ["lstm", 3, 0, {}], ["lstm", 3, 2, {}]], [["lambda_16", 0, 0, {}], ["lstm", 4, 0, {}], ["lstm", 4, 2, {}]], [["lambda_17", 0, 0, {}], ["lstm", 5, 0, {}], ["lstm", 5, 2, {}]], [["lambda_18", 0, 0, {}], ["lstm", 6, 0, {}], ["lstm", 6, 2, {}]], [["lambda_19", 0, 0, {}], ["lstm", 7, 0, {}], ["lstm", 7, 2, {}]], [["lambda_20", 0, 0, {}], ["lstm", 8, 0, {}], ["lstm", 8, 2, {}]], [["lambda_21", 0, 0, {}], ["lstm", 9, 0, {}], ["lstm", 9, 2, {}]], [["lambda_22", 0, 0, {}], ["lstm", 10, 0, {}], ["lstm", 10, 2, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 278, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 64]}, "name": "dense", "inbound_nodes": [[["lstm", 0, 0, {}]], [["lstm", 1, 0, {}]], [["lstm", 2, 0, {}]], [["lstm", 3, 0, {}]], [["lstm", 4, 0, {}]], [["lstm", 5, 0, {}]], [["lstm", 6, 0, {}]], [["lstm", 7, 0, {}]], [["lstm", 8, 0, {}]], [["lstm", 9, 0, {}]], [["lstm", 10, 0, {}]], [["lstm", 11, 0, {}]]]}, {"module": "keras.layers", "class_name": "Lambda", "config": {"name": "lambda_12", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAQAAAATAAAA86IAAACVAZcAdAAAAAAAAAAAAAAAoAEAAAAAAAAAAAAAAAAA\nAAAAAAAAAHwApgEAAKsBAAAAAAAAAAB9AHQEAAAAAAAAAAAAAKADAAAAAAAAAAAAAAAAAAAAAAAA\nAAB8AIkBpgIAAKsCAAAAAAAAAAB9AAIAdAkAAAAAAAAAAAAAZAGmAQAAqwEAAAAAAAAAAHwApgEA\nAKsBAAAAAAAAAAB9AHwAUwApAk7pAQAAACkF2gFL2gZhcmdtYXjaAnRm2gdvbmVfaG902gxSZXBl\nYXRWZWN0b3IpAtoBeNoIbl92YWx1ZXNzAgAAACCA+k4vdmFyL2ZvbGRlcnMvbmwvanE5OHkwZDk3\nZzk1bTk0eXN0Z3MxNG1jMDAwMGduL1QvaXB5a2VybmVsXzc3NjkxLzQwMTY4Njc3NzgucHlyBgAA\nAPodZGVlcFJvdXRlU2V0Ljxsb2NhbHM+Lm9uZV9ob3QPAAAAcz8AAAD4gADdDA2PSIpIkFGJS4xL\niAHdDA6PSopKkHGYKNEMI9QMI4gB2AwbjUyYEYlPjE+YQdEMHtQMHogB2A8QiAjzAAAAAA==\n", null, [278]], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "registered_name": null, "build_config": {"input_shape": [null, 278]}, "name": "lambda_12", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Lambda", "config": {"name": "lambda_13", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAQAAAATAAAA86IAAACVAZcAdAAAAAAAAAAAAAAAoAEAAAAAAAAAAAAAAAAA\nAAAAAAAAAHwApgEAAKsBAAAAAAAAAAB9AHQEAAAAAAAAAAAAAKADAAAAAAAAAAAAAAAAAAAAAAAA\nAAB8AIkBpgIAAKsCAAAAAAAAAAB9AAIAdAkAAAAAAAAAAAAAZAGmAQAAqwEAAAAAAAAAAHwApgEA\nAKsBAAAAAAAAAAB9AHwAUwApAk7pAQAAACkF2gFL2gZhcmdtYXjaAnRm2gdvbmVfaG902gxSZXBl\nYXRWZWN0b3IpAtoBeNoIbl92YWx1ZXNzAgAAACCA+k4vdmFyL2ZvbGRlcnMvbmwvanE5OHkwZDk3\nZzk1bTk0eXN0Z3MxNG1jMDAwMGduL1QvaXB5a2VybmVsXzc3NjkxLzQwMTY4Njc3NzgucHlyBgAA\nAPodZGVlcFJvdXRlU2V0Ljxsb2NhbHM+Lm9uZV9ob3QPAAAAcz8AAAD4gADdDA2PSIpIkFGJS4xL\niAHdDA6PSopKkHGYKNEMI9QMI4gB2AwbjUyYEYlPjE+YQdEMHtQMHogB2A8QiAjzAAAAAA==\n", null, [278]], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "registered_name": null, "build_config": {"input_shape": [null, 278]}, "name": "lambda_13", "inbound_nodes": [[["dense", 1, 0, {}]]]}, {"module": "keras.layers", "class_name": "Lambda", "config": {"name": "lambda_14", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAQAAAATAAAA86IAAACVAZcAdAAAAAAAAAAAAAAAoAEAAAAAAAAAAAAAAAAA\nAAAAAAAAAHwApgEAAKsBAAAAAAAAAAB9AHQEAAAAAAAAAAAAAKADAAAAAAAAAAAAAAAAAAAAAAAA\nAAB8AIkBpgIAAKsCAAAAAAAAAAB9AAIAdAkAAAAAAAAAAAAAZAGmAQAAqwEAAAAAAAAAAHwApgEA\nAKsBAAAAAAAAAAB9AHwAUwApAk7pAQAAACkF2gFL2gZhcmdtYXjaAnRm2gdvbmVfaG902gxSZXBl\nYXRWZWN0b3IpAtoBeNoIbl92YWx1ZXNzAgAAACCA+k4vdmFyL2ZvbGRlcnMvbmwvanE5OHkwZDk3\nZzk1bTk0eXN0Z3MxNG1jMDAwMGduL1QvaXB5a2VybmVsXzc3NjkxLzQwMTY4Njc3NzgucHlyBgAA\nAPodZGVlcFJvdXRlU2V0Ljxsb2NhbHM+Lm9uZV9ob3QPAAAAcz8AAAD4gADdDA2PSIpIkFGJS4xL\niAHdDA6PSopKkHGYKNEMI9QMI4gB2AwbjUyYEYlPjE+YQdEMHtQMHogB2A8QiAjzAAAAAA==\n", null, [278]], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "registered_name": null, "build_config": {"input_shape": [null, 278]}, "name": "lambda_14", "inbound_nodes": [[["dense", 2, 0, {}]]]}, {"module": "keras.layers", "class_name": "Lambda", "config": {"name": "lambda_15", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAQAAAATAAAA86IAAACVAZcAdAAAAAAAAAAAAAAAoAEAAAAAAAAAAAAAAAAA\nAAAAAAAAAHwApgEAAKsBAAAAAAAAAAB9AHQEAAAAAAAAAAAAAKADAAAAAAAAAAAAAAAAAAAAAAAA\nAAB8AIkBpgIAAKsCAAAAAAAAAAB9AAIAdAkAAAAAAAAAAAAAZAGmAQAAqwEAAAAAAAAAAHwApgEA\nAKsBAAAAAAAAAAB9AHwAUwApAk7pAQAAACkF2gFL2gZhcmdtYXjaAnRm2gdvbmVfaG902gxSZXBl\nYXRWZWN0b3IpAtoBeNoIbl92YWx1ZXNzAgAAACCA+k4vdmFyL2ZvbGRlcnMvbmwvanE5OHkwZDk3\nZzk1bTk0eXN0Z3MxNG1jMDAwMGduL1QvaXB5a2VybmVsXzc3NjkxLzQwMTY4Njc3NzgucHlyBgAA\nAPodZGVlcFJvdXRlU2V0Ljxsb2NhbHM+Lm9uZV9ob3QPAAAAcz8AAAD4gADdDA2PSIpIkFGJS4xL\niAHdDA6PSopKkHGYKNEMI9QMI4gB2AwbjUyYEYlPjE+YQdEMHtQMHogB2A8QiAjzAAAAAA==\n", null, [278]], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "registered_name": null, "build_config": {"input_shape": [null, 278]}, "name": "lambda_15", "inbound_nodes": [[["dense", 3, 0, {}]]]}, {"module": "keras.layers", "class_name": "Lambda", "config": {"name": "lambda_16", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAQAAAATAAAA86IAAACVAZcAdAAAAAAAAAAAAAAAoAEAAAAAAAAAAAAAAAAA\nAAAAAAAAAHwApgEAAKsBAAAAAAAAAAB9AHQEAAAAAAAAAAAAAKADAAAAAAAAAAAAAAAAAAAAAAAA\nAAB8AIkBpgIAAKsCAAAAAAAAAAB9AAIAdAkAAAAAAAAAAAAAZAGmAQAAqwEAAAAAAAAAAHwApgEA\nAKsBAAAAAAAAAAB9AHwAUwApAk7pAQAAACkF2gFL2gZhcmdtYXjaAnRm2gdvbmVfaG902gxSZXBl\nYXRWZWN0b3IpAtoBeNoIbl92YWx1ZXNzAgAAACCA+k4vdmFyL2ZvbGRlcnMvbmwvanE5OHkwZDk3\nZzk1bTk0eXN0Z3MxNG1jMDAwMGduL1QvaXB5a2VybmVsXzc3NjkxLzQwMTY4Njc3NzgucHlyBgAA\nAPodZGVlcFJvdXRlU2V0Ljxsb2NhbHM+Lm9uZV9ob3QPAAAAcz8AAAD4gADdDA2PSIpIkFGJS4xL\niAHdDA6PSopKkHGYKNEMI9QMI4gB2AwbjUyYEYlPjE+YQdEMHtQMHogB2A8QiAjzAAAAAA==\n", null, [278]], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "registered_name": null, "build_config": {"input_shape": [null, 278]}, "name": "lambda_16", "inbound_nodes": [[["dense", 4, 0, {}]]]}, {"module": "keras.layers", "class_name": "Lambda", "config": {"name": "lambda_17", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAQAAAATAAAA86IAAACVAZcAdAAAAAAAAAAAAAAAoAEAAAAAAAAAAAAAAAAA\nAAAAAAAAAHwApgEAAKsBAAAAAAAAAAB9AHQEAAAAAAAAAAAAAKADAAAAAAAAAAAAAAAAAAAAAAAA\nAAB8AIkBpgIAAKsCAAAAAAAAAAB9AAIAdAkAAAAAAAAAAAAAZAGmAQAAqwEAAAAAAAAAAHwApgEA\nAKsBAAAAAAAAAAB9AHwAUwApAk7pAQAAACkF2gFL2gZhcmdtYXjaAnRm2gdvbmVfaG902gxSZXBl\nYXRWZWN0b3IpAtoBeNoIbl92YWx1ZXNzAgAAACCA+k4vdmFyL2ZvbGRlcnMvbmwvanE5OHkwZDk3\nZzk1bTk0eXN0Z3MxNG1jMDAwMGduL1QvaXB5a2VybmVsXzc3NjkxLzQwMTY4Njc3NzgucHlyBgAA\nAPodZGVlcFJvdXRlU2V0Ljxsb2NhbHM+Lm9uZV9ob3QPAAAAcz8AAAD4gADdDA2PSIpIkFGJS4xL\niAHdDA6PSopKkHGYKNEMI9QMI4gB2AwbjUyYEYlPjE+YQdEMHtQMHogB2A8QiAjzAAAAAA==\n", null, [278]], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "registered_name": null, "build_config": {"input_shape": [null, 278]}, "name": "lambda_17", "inbound_nodes": [[["dense", 5, 0, {}]]]}, {"module": "keras.layers", "class_name": "Lambda", "config": {"name": "lambda_18", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAQAAAATAAAA86IAAACVAZcAdAAAAAAAAAAAAAAAoAEAAAAAAAAAAAAAAAAA\nAAAAAAAAAHwApgEAAKsBAAAAAAAAAAB9AHQEAAAAAAAAAAAAAKADAAAAAAAAAAAAAAAAAAAAAAAA\nAAB8AIkBpgIAAKsCAAAAAAAAAAB9AAIAdAkAAAAAAAAAAAAAZAGmAQAAqwEAAAAAAAAAAHwApgEA\nAKsBAAAAAAAAAAB9AHwAUwApAk7pAQAAACkF2gFL2gZhcmdtYXjaAnRm2gdvbmVfaG902gxSZXBl\nYXRWZWN0b3IpAtoBeNoIbl92YWx1ZXNzAgAAACCA+k4vdmFyL2ZvbGRlcnMvbmwvanE5OHkwZDk3\nZzk1bTk0eXN0Z3MxNG1jMDAwMGduL1QvaXB5a2VybmVsXzc3NjkxLzQwMTY4Njc3NzgucHlyBgAA\nAPodZGVlcFJvdXRlU2V0Ljxsb2NhbHM+Lm9uZV9ob3QPAAAAcz8AAAD4gADdDA2PSIpIkFGJS4xL\niAHdDA6PSopKkHGYKNEMI9QMI4gB2AwbjUyYEYlPjE+YQdEMHtQMHogB2A8QiAjzAAAAAA==\n", null, [278]], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "registered_name": null, "build_config": {"input_shape": [null, 278]}, "name": "lambda_18", "inbound_nodes": [[["dense", 6, 0, {}]]]}, {"module": "keras.layers", "class_name": "Lambda", "config": {"name": "lambda_19", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAQAAAATAAAA86IAAACVAZcAdAAAAAAAAAAAAAAAoAEAAAAAAAAAAAAAAAAA\nAAAAAAAAAHwApgEAAKsBAAAAAAAAAAB9AHQEAAAAAAAAAAAAAKADAAAAAAAAAAAAAAAAAAAAAAAA\nAAB8AIkBpgIAAKsCAAAAAAAAAAB9AAIAdAkAAAAAAAAAAAAAZAGmAQAAqwEAAAAAAAAAAHwApgEA\nAKsBAAAAAAAAAAB9AHwAUwApAk7pAQAAACkF2gFL2gZhcmdtYXjaAnRm2gdvbmVfaG902gxSZXBl\nYXRWZWN0b3IpAtoBeNoIbl92YWx1ZXNzAgAAACCA+k4vdmFyL2ZvbGRlcnMvbmwvanE5OHkwZDk3\nZzk1bTk0eXN0Z3MxNG1jMDAwMGduL1QvaXB5a2VybmVsXzc3NjkxLzQwMTY4Njc3NzgucHlyBgAA\nAPodZGVlcFJvdXRlU2V0Ljxsb2NhbHM+Lm9uZV9ob3QPAAAAcz8AAAD4gADdDA2PSIpIkFGJS4xL\niAHdDA6PSopKkHGYKNEMI9QMI4gB2AwbjUyYEYlPjE+YQdEMHtQMHogB2A8QiAjzAAAAAA==\n", null, [278]], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "registered_name": null, "build_config": {"input_shape": [null, 278]}, "name": "lambda_19", "inbound_nodes": [[["dense", 7, 0, {}]]]}, {"module": "keras.layers", "class_name": "Lambda", "config": {"name": "lambda_20", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAQAAAATAAAA86IAAACVAZcAdAAAAAAAAAAAAAAAoAEAAAAAAAAAAAAAAAAA\nAAAAAAAAAHwApgEAAKsBAAAAAAAAAAB9AHQEAAAAAAAAAAAAAKADAAAAAAAAAAAAAAAAAAAAAAAA\nAAB8AIkBpgIAAKsCAAAAAAAAAAB9AAIAdAkAAAAAAAAAAAAAZAGmAQAAqwEAAAAAAAAAAHwApgEA\nAKsBAAAAAAAAAAB9AHwAUwApAk7pAQAAACkF2gFL2gZhcmdtYXjaAnRm2gdvbmVfaG902gxSZXBl\nYXRWZWN0b3IpAtoBeNoIbl92YWx1ZXNzAgAAACCA+k4vdmFyL2ZvbGRlcnMvbmwvanE5OHkwZDk3\nZzk1bTk0eXN0Z3MxNG1jMDAwMGduL1QvaXB5a2VybmVsXzc3NjkxLzQwMTY4Njc3NzgucHlyBgAA\nAPodZGVlcFJvdXRlU2V0Ljxsb2NhbHM+Lm9uZV9ob3QPAAAAcz8AAAD4gADdDA2PSIpIkFGJS4xL\niAHdDA6PSopKkHGYKNEMI9QMI4gB2AwbjUyYEYlPjE+YQdEMHtQMHogB2A8QiAjzAAAAAA==\n", null, [278]], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "registered_name": null, "build_config": {"input_shape": [null, 278]}, "name": "lambda_20", "inbound_nodes": [[["dense", 8, 0, {}]]]}, {"module": "keras.layers", "class_name": "Lambda", "config": {"name": "lambda_21", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAQAAAATAAAA86IAAACVAZcAdAAAAAAAAAAAAAAAoAEAAAAAAAAAAAAAAAAA\nAAAAAAAAAHwApgEAAKsBAAAAAAAAAAB9AHQEAAAAAAAAAAAAAKADAAAAAAAAAAAAAAAAAAAAAAAA\nAAB8AIkBpgIAAKsCAAAAAAAAAAB9AAIAdAkAAAAAAAAAAAAAZAGmAQAAqwEAAAAAAAAAAHwApgEA\nAKsBAAAAAAAAAAB9AHwAUwApAk7pAQAAACkF2gFL2gZhcmdtYXjaAnRm2gdvbmVfaG902gxSZXBl\nYXRWZWN0b3IpAtoBeNoIbl92YWx1ZXNzAgAAACCA+k4vdmFyL2ZvbGRlcnMvbmwvanE5OHkwZDk3\nZzk1bTk0eXN0Z3MxNG1jMDAwMGduL1QvaXB5a2VybmVsXzc3NjkxLzQwMTY4Njc3NzgucHlyBgAA\nAPodZGVlcFJvdXRlU2V0Ljxsb2NhbHM+Lm9uZV9ob3QPAAAAcz8AAAD4gADdDA2PSIpIkFGJS4xL\niAHdDA6PSopKkHGYKNEMI9QMI4gB2AwbjUyYEYlPjE+YQdEMHtQMHogB2A8QiAjzAAAAAA==\n", null, [278]], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "registered_name": null, "build_config": {"input_shape": [null, 278]}, "name": "lambda_21", "inbound_nodes": [[["dense", 9, 0, {}]]]}, {"module": "keras.layers", "class_name": "Lambda", "config": {"name": "lambda_22", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAQAAAATAAAA86IAAACVAZcAdAAAAAAAAAAAAAAAoAEAAAAAAAAAAAAAAAAA\nAAAAAAAAAHwApgEAAKsBAAAAAAAAAAB9AHQEAAAAAAAAAAAAAKADAAAAAAAAAAAAAAAAAAAAAAAA\nAAB8AIkBpgIAAKsCAAAAAAAAAAB9AAIAdAkAAAAAAAAAAAAAZAGmAQAAqwEAAAAAAAAAAHwApgEA\nAKsBAAAAAAAAAAB9AHwAUwApAk7pAQAAACkF2gFL2gZhcmdtYXjaAnRm2gdvbmVfaG902gxSZXBl\nYXRWZWN0b3IpAtoBeNoIbl92YWx1ZXNzAgAAACCA+k4vdmFyL2ZvbGRlcnMvbmwvanE5OHkwZDk3\nZzk1bTk0eXN0Z3MxNG1jMDAwMGduL1QvaXB5a2VybmVsXzc3NjkxLzQwMTY4Njc3NzgucHlyBgAA\nAPodZGVlcFJvdXRlU2V0Ljxsb2NhbHM+Lm9uZV9ob3QPAAAAcz8AAAD4gADdDA2PSIpIkFGJS4xL\niAHdDA6PSopKkHGYKNEMI9QMI4gB2AwbjUyYEYlPjE+YQdEMHtQMHogB2A8QiAjzAAAAAA==\n", null, [278]], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "registered_name": null, "build_config": {"input_shape": [null, 278]}, "name": "lambda_22", "inbound_nodes": [[["dense", 10, 0, {}]]]}], "input_layers": [["input_2", 0, 0], ["a0", 0, 0], ["c0", 0, 0]], "output_layers": [["dense", 0, 0], ["dense", 1, 0], ["dense", 2, 0], ["dense", 3, 0], ["dense", 4, 0], ["dense", 5, 0], ["dense", 6, 0], ["dense", 7, 0], ["dense", 8, 0], ["dense", 9, 0], ["dense", 10, 0], ["dense", 11, 0]]}, "keras_version": "2.14.0", "backend": "tensorflow"}