{"class_name": "Functional", "config": {"name": "model_7", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 278], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_8"}, "name": "input_8", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64], "dtype": "float32", "sparse": false, "ragged": false, "name": "a0"}, "name": "a0", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64], "dtype": "float32", "sparse": false, "ragged": false, "name": "c0"}, "name": "c0", "inbound_nodes": []}, {"class_name": "LSTM", "config": {"name": "lstm_6", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 3}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 4}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 5}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "name": "lstm_6", "inbound_nodes": [[["input_8", 0, 0, {}], ["a0", 0, 0, {}], ["c0", 0, 0, {}]], [["lambda_84", 0, 0, {}], ["lstm_6", 0, 0, {}], ["lstm_6", 0, 2, {}]], [["lambda_85", 0, 0, {}], ["lstm_6", 1, 0, {}], ["lstm_6", 1, 2, {}]], [["lambda_86", 0, 0, {}], ["lstm_6", 2, 0, {}], ["lstm_6", 2, 2, {}]], [["lambda_87", 0, 0, {}], ["lstm_6", 3, 0, {}], ["lstm_6", 3, 2, {}]], [["lambda_88", 0, 0, {}], ["lstm_6", 4, 0, {}], ["lstm_6", 4, 2, {}]], [["lambda_89", 0, 0, {}], ["lstm_6", 5, 0, {}], ["lstm_6", 5, 2, {}]], [["lambda_90", 0, 0, {}], ["lstm_6", 6, 0, {}], ["lstm_6", 6, 2, {}]], [["lambda_91", 0, 0, {}], ["lstm_6", 7, 0, {}], ["lstm_6", 7, 2, {}]], [["lambda_92", 0, 0, {}], ["lstm_6", 8, 0, {}], ["lstm_6", 8, 2, {}]], [["lambda_93", 0, 0, {}], ["lstm_6", 9, 0, {}], ["lstm_6", 9, 2, {}]], [["lambda_94", 0, 0, {}], ["lstm_6", 10, 0, {}], ["lstm_6", 10, 2, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_6", "trainable": true, "dtype": "float32", "units": 278, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_6", "inbound_nodes": [[["lstm_6", 0, 0, {}]], [["lstm_6", 1, 0, {}]], [["lstm_6", 2, 0, {}]], [["lstm_6", 3, 0, {}]], [["lstm_6", 4, 0, {}]], [["lstm_6", 5, 0, {}]], [["lstm_6", 6, 0, {}]], [["lstm_6", 7, 0, {}]], [["lstm_6", 8, 0, {}]], [["lstm_6", 9, 0, {}]], [["lstm_6", 10, 0, {}]], [["lstm_6", 11, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_84", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAEAAAAEwAAAHMmAAAAdACgAXwAoQF9AHQCoAN8AIgAoQJ9AHQEZAGD\nAXwAgwF9AHwAUwApAk7pAQAAACkF2gFL2gZhcmdtYXjaAnRm2gdvbmVfaG902gxSZXBlYXRWZWN0\nb3IpAdoBeKkB2ghuX3ZhbHVlc6kA+kBDOi9Vc2Vycy9MZW5vdm8vQXBwRGF0YS9Mb2NhbC9UZW1w\nL2lweWtlcm5lbF8zMjQyOC80MDE2ODY3Nzc4LnB5cgUAAAAPAAAAcwgAAAAAAQoBDAEMAQ==\n", null, [278]], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_84", "inbound_nodes": [[["dense_6", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_85", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAEAAAAEwAAAHMmAAAAdACgAXwAoQF9AHQCoAN8AIgAoQJ9AHQEZAGD\nAXwAgwF9AHwAUwApAk7pAQAAACkF2gFL2gZhcmdtYXjaAnRm2gdvbmVfaG902gxSZXBlYXRWZWN0\nb3IpAdoBeKkB2ghuX3ZhbHVlc6kA+kBDOi9Vc2Vycy9MZW5vdm8vQXBwRGF0YS9Mb2NhbC9UZW1w\nL2lweWtlcm5lbF8zMjQyOC80MDE2ODY3Nzc4LnB5cgUAAAAPAAAAcwgAAAAAAQoBDAEMAQ==\n", null, [278]], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_85", "inbound_nodes": [[["dense_6", 1, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_86", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAEAAAAEwAAAHMmAAAAdACgAXwAoQF9AHQCoAN8AIgAoQJ9AHQEZAGD\nAXwAgwF9AHwAUwApAk7pAQAAACkF2gFL2gZhcmdtYXjaAnRm2gdvbmVfaG902gxSZXBlYXRWZWN0\nb3IpAdoBeKkB2ghuX3ZhbHVlc6kA+kBDOi9Vc2Vycy9MZW5vdm8vQXBwRGF0YS9Mb2NhbC9UZW1w\nL2lweWtlcm5lbF8zMjQyOC80MDE2ODY3Nzc4LnB5cgUAAAAPAAAAcwgAAAAAAQoBDAEMAQ==\n", null, [278]], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_86", "inbound_nodes": [[["dense_6", 2, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_87", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAEAAAAEwAAAHMmAAAAdACgAXwAoQF9AHQCoAN8AIgAoQJ9AHQEZAGD\nAXwAgwF9AHwAUwApAk7pAQAAACkF2gFL2gZhcmdtYXjaAnRm2gdvbmVfaG902gxSZXBlYXRWZWN0\nb3IpAdoBeKkB2ghuX3ZhbHVlc6kA+kBDOi9Vc2Vycy9MZW5vdm8vQXBwRGF0YS9Mb2NhbC9UZW1w\nL2lweWtlcm5lbF8zMjQyOC80MDE2ODY3Nzc4LnB5cgUAAAAPAAAAcwgAAAAAAQoBDAEMAQ==\n", null, [278]], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_87", "inbound_nodes": [[["dense_6", 3, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_88", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAEAAAAEwAAAHMmAAAAdACgAXwAoQF9AHQCoAN8AIgAoQJ9AHQEZAGD\nAXwAgwF9AHwAUwApAk7pAQAAACkF2gFL2gZhcmdtYXjaAnRm2gdvbmVfaG902gxSZXBlYXRWZWN0\nb3IpAdoBeKkB2ghuX3ZhbHVlc6kA+kBDOi9Vc2Vycy9MZW5vdm8vQXBwRGF0YS9Mb2NhbC9UZW1w\nL2lweWtlcm5lbF8zMjQyOC80MDE2ODY3Nzc4LnB5cgUAAAAPAAAAcwgAAAAAAQoBDAEMAQ==\n", null, [278]], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_88", "inbound_nodes": [[["dense_6", 4, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_89", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAEAAAAEwAAAHMmAAAAdACgAXwAoQF9AHQCoAN8AIgAoQJ9AHQEZAGD\nAXwAgwF9AHwAUwApAk7pAQAAACkF2gFL2gZhcmdtYXjaAnRm2gdvbmVfaG902gxSZXBlYXRWZWN0\nb3IpAdoBeKkB2ghuX3ZhbHVlc6kA+kBDOi9Vc2Vycy9MZW5vdm8vQXBwRGF0YS9Mb2NhbC9UZW1w\nL2lweWtlcm5lbF8zMjQyOC80MDE2ODY3Nzc4LnB5cgUAAAAPAAAAcwgAAAAAAQoBDAEMAQ==\n", null, [278]], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_89", "inbound_nodes": [[["dense_6", 5, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_90", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAEAAAAEwAAAHMmAAAAdACgAXwAoQF9AHQCoAN8AIgAoQJ9AHQEZAGD\nAXwAgwF9AHwAUwApAk7pAQAAACkF2gFL2gZhcmdtYXjaAnRm2gdvbmVfaG902gxSZXBlYXRWZWN0\nb3IpAdoBeKkB2ghuX3ZhbHVlc6kA+kBDOi9Vc2Vycy9MZW5vdm8vQXBwRGF0YS9Mb2NhbC9UZW1w\nL2lweWtlcm5lbF8zMjQyOC80MDE2ODY3Nzc4LnB5cgUAAAAPAAAAcwgAAAAAAQoBDAEMAQ==\n", null, [278]], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_90", "inbound_nodes": [[["dense_6", 6, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_91", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAEAAAAEwAAAHMmAAAAdACgAXwAoQF9AHQCoAN8AIgAoQJ9AHQEZAGD\nAXwAgwF9AHwAUwApAk7pAQAAACkF2gFL2gZhcmdtYXjaAnRm2gdvbmVfaG902gxSZXBlYXRWZWN0\nb3IpAdoBeKkB2ghuX3ZhbHVlc6kA+kBDOi9Vc2Vycy9MZW5vdm8vQXBwRGF0YS9Mb2NhbC9UZW1w\nL2lweWtlcm5lbF8zMjQyOC80MDE2ODY3Nzc4LnB5cgUAAAAPAAAAcwgAAAAAAQoBDAEMAQ==\n", null, [278]], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_91", "inbound_nodes": [[["dense_6", 7, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_92", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAEAAAAEwAAAHMmAAAAdACgAXwAoQF9AHQCoAN8AIgAoQJ9AHQEZAGD\nAXwAgwF9AHwAUwApAk7pAQAAACkF2gFL2gZhcmdtYXjaAnRm2gdvbmVfaG902gxSZXBlYXRWZWN0\nb3IpAdoBeKkB2ghuX3ZhbHVlc6kA+kBDOi9Vc2Vycy9MZW5vdm8vQXBwRGF0YS9Mb2NhbC9UZW1w\nL2lweWtlcm5lbF8zMjQyOC80MDE2ODY3Nzc4LnB5cgUAAAAPAAAAcwgAAAAAAQoBDAEMAQ==\n", null, [278]], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_92", "inbound_nodes": [[["dense_6", 8, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_93", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAEAAAAEwAAAHMmAAAAdACgAXwAoQF9AHQCoAN8AIgAoQJ9AHQEZAGD\nAXwAgwF9AHwAUwApAk7pAQAAACkF2gFL2gZhcmdtYXjaAnRm2gdvbmVfaG902gxSZXBlYXRWZWN0\nb3IpAdoBeKkB2ghuX3ZhbHVlc6kA+kBDOi9Vc2Vycy9MZW5vdm8vQXBwRGF0YS9Mb2NhbC9UZW1w\nL2lweWtlcm5lbF8zMjQyOC80MDE2ODY3Nzc4LnB5cgUAAAAPAAAAcwgAAAAAAQoBDAEMAQ==\n", null, [278]], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_93", "inbound_nodes": [[["dense_6", 9, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_94", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAEAAAAEwAAAHMmAAAAdACgAXwAoQF9AHQCoAN8AIgAoQJ9AHQEZAGD\nAXwAgwF9AHwAUwApAk7pAQAAACkF2gFL2gZhcmdtYXjaAnRm2gdvbmVfaG902gxSZXBlYXRWZWN0\nb3IpAdoBeKkB2ghuX3ZhbHVlc6kA+kBDOi9Vc2Vycy9MZW5vdm8vQXBwRGF0YS9Mb2NhbC9UZW1w\nL2lweWtlcm5lbF8zMjQyOC80MDE2ODY3Nzc4LnB5cgUAAAAPAAAAcwgAAAAAAQoBDAEMAQ==\n", null, [278]], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_94", "inbound_nodes": [[["dense_6", 10, 0, {}]]]}], "input_layers": [["input_8", 0, 0], ["a0", 0, 0], ["c0", 0, 0]], "output_layers": [["dense_6", 0, 0], ["dense_6", 1, 0], ["dense_6", 2, 0], ["dense_6", 3, 0], ["dense_6", 4, 0], ["dense_6", 5, 0], ["dense_6", 6, 0], ["dense_6", 7, 0], ["dense_6", 8, 0], ["dense_6", 9, 0], ["dense_6", 10, 0], ["dense_6", 11, 0]]}, "keras_version": "2.12.0", "backend": "tensorflow"}